src/cf/src/Documents/ПересчётТоваров/ПересчётТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПересчётТоваров</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыСкладскихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокФакт</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Enums/ВидыСкладскихОпераций/ВидыСкладскихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСкладскихОпераций</name>
  <enumValues>
    <name>Склад</name>
  </enumValues>
  <enumValues>
    <name>Станок</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/СтатусыДокументов/СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументов</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ОприходованиеТоваров/ОприходованиеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОприходованиеТоваров</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыСкладскихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПересчётТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/СписаниеТоваров/СписаниеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТоваров</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыСкладскихОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>Станок</name>
    <type>
      <types>CatalogRef.ПроизводственноеОборудование</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПересчётТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Documents/ЗаданиеНаПересчет/ЗаданиеНаПересчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаданиеНаПересчет</name>
  <attributes>
    <name>ПересчетТовара</name>
    <type>
      <types>DocumentRef.ПересчётТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРасчета</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Catalogs/ПроизводственноеОборудование/ПроизводственноеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроизводственноеОборудование</name>
  <attributes>
    <name>ВидСтанка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выработка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНаСменуЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>0</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладСтанка</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оператор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Выведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РаботаетБезКалендаря</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РежимРаботы</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>EnumRef.ДниНедели</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоСмены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОкончаниеСмены</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Круглосуточно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыработкаПоНоменклатуре</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Выработка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Documents/ПересчётТоваров/Forms/ФормаДокумента/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("МестоХранения", Объект.МестоХранения));
	// Форма ставит параметры опций сама, минуя РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций,
	// поэтому надпись базовой единицы настраивается отдельным вызовом.
	РаботаСДокументамиКлиентСервер.НастроитьВидимостьБазовойЕдиницы(ЭтотОбъект);
	Если Не ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		// Документ до волны 5 - «По складу»: переключатель показывает выбранный вид.
		Объект.ВидОперации = Перечисления.ВидыСкладскихОпераций.Склад;
	КонецЕсли;
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтотОбъект, Объект, ЗагрузкаСтанков.ЗаголовокДокументаПоСтанку(Объект));
	Если Объект.ВидОперации = Перечисления.ВидыСкладскихОпераций.Станок И Объект.Ссылка.Пустая() Тогда
		Объект.МестоХранения = ЗагрузкаСтанков.СкладСтанка(Объект.Станок);
	КонецЕсли;
	НастроитьПолеСклада(ЭтотОбъект);
	// Учёт станков выключен: станок и вид операции скрыты опцией, склад документа виден всегда (ревью Codex волны 5).
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУчетСтанков") Тогда
		Элементы.МестоХранения.Видимость = Истина;
	КонецЕсли;
	КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подменю", Элементы.ТЧТовары.КоманднаяПанель);
	Если Не ТолькоПросмотр Тогда
		КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подбор", Элементы.ТЧТовары.КоманднаяПанель);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина); 
	РассчитатьОтклонения();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	НужноПерезаполнитьПодчинённыеДокументы = Модифицированность и Не СозданиеПодчинённыхДокументов и ПолучитьПодчинённыеДокументы(Объект.Ссылка).Количество() > 0;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	РассчитатьОтклонения();
	//Если НужноПерезаполнитьПодчинённыеДокументы Тогда
	//	Оп = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПерезаполненииПодчинённыхДокументов", ЭтотОбъект);
	//	ПоказатьВопрос(Оп, Нстр("fr = 'Actualiser les documents liés?'; ru = 'Перезаполнить связанные оприходование/списание товаров?'; en = 'Should I re-fill in the related product deposits/debits?'; es = '¿Volver a cargar los productos relacionados?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да, "Внимание");	
	//КонецЕсли;
	//ПерезаполнитьПодчинённыеДокументы(Объект.Ссылка);
	//СозданиеПодчинённыхДокументов = Ложь;
	Если Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументов.Завершен") Тогда 
		СоздатьОприходованиеСписаниеТоваровНаСервере();
	Иначе
		ПерезаполнитьПодчинённыеДокументы(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтотОбъект, ТекущийОбъект,
		ЗагрузкаСтанков.ЗаголовокДокументаПоСтанку(ТекущийОбъект));
КонецПроцедуры

#КонецОбласти

#Область Обработчики_элементов_формы

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("МестоХранения", Объект.МестоХранения));
	ПересчитатьСтрокиПоМестуХранения();
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные);
КонецПроцедуры 

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокФактПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧТовары.ТекущиеДанные;
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(ТекСтр,,, "Факт");
	ТекСтр.КоличествоУпаковокОтклонение = ТекСтр.КоличествоУпаковокФакт - ТекСтр.КоличествоУпаковок;		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТовары(Команда)
	Если Объект.ТЧТовары.Количество() > 0 Тогда
		Оп = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОПерезаполненииТоваров", ЭтотОбъект);
		ПоказатьВопрос(Оп, Нстр("fr = 'La liste des marchandises sera actualisée. Continuer?'; ru = 'Список товаров будет перезаполнен. Продолжить?'; en = 'The list of products will be updated. Continue?'; es = 'La lista de productos se reiniciará. ¿Continuar?'"), РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);	
	Иначе
		ПослеЗакрытияВопросаОПерезаполненииТоваров(КодВозвратаДиалога.Да, Неопределено);	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатки(Команда)
	ЗаполнитьОстаткиНаСервере();
	РассчитатьОтклонения();	
КонецПроцедуры
	
&НаКлиенте
Процедура СоздатьОприходованиеСписаниеТоваров(Команда)
	СозданиеПодчинённыхДокументов = Истина;
	РаботаСДокументамиКлиент.ЗаписатьЕслиНовый(ЭтаФорма, Истина);
	МасДокументы = СоздатьОприходованиеСписаниеТоваровНаСервере();
	Для Каждого Док Из МасДокументы Цикл
		ПоказатьЗначение(, Док);	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаданиямНаПересчет(Команда)
	ЗаполнитьПоЗаданиямНаПересчетНаСервере();
	РассчитатьОтклонения();
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПерезаполненииТоваров(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда Возврат КонецЕсли;
	ЗаполнитьТоварыНаСервере();
	РассчитатьОтклонения();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОПерезаполненииПодчинённыхДокументов(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда Возврат КонецЕсли;
	МасДокументы = ПерезаполнитьПодчинённыеДокументы(Объект.Ссылка);
	Для Каждого Док Из МасДокументы Цикл
		ПоказатьЗначение(, Док);	
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
		Если СтруктураТОвара = Неопределено Тогда
			Оп = Новый ОписаниеОповещения("ПослеДобавленияНоменклатуры",ЭтаФорма,Новый Структура("Штрихкод",Штрихкод));
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",Новый Структура("Штрихкод",Штрихкод),ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТОвара,,,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Процедура ЗаполнитьТоварыНаСервере()
	// BSLLS:YoLetterUsage-off - имя документа
	Объект.ТЧТовары.Загрузить(Документы.ПересчётТоваров.УчетныеОстатки(Объект));
	// BSLLS:YoLetterUsage-on
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	// BSLLS:YoLetterUsage-off - имя документа
	Документы.ПересчётТоваров.ЗаполнитьУчетноеКоличество(Объект);
	// BSLLS:YoLetterUsage-on
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьОтклонения()
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Стр.КоличествоУпаковокОтклонение = Стр.КоличествоУпаковокФакт - Стр.КоличествоУпаковок;	
	КонецЦикла;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПодчинённыеДокументы(Док)
	Результат = Новый Массив;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОприходованиеТоваров.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.ОприходованиеТоваров КАК ОприходованиеТоваров
	                      |ГДЕ
	                      |	ОприходованиеТоваров.Основание = &Док
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	СписаниеТоваров.Ссылка
	                      |ИЗ
	                      |	Документ.СписаниеТоваров КАК СписаниеТоваров
	                      |ГДЕ
	                      |	СписаниеТоваров.Основание = &Док");
	Запрос.УстановитьПараметр("Док", Док);
	Если ЗначениеЗаполнено(Док) Тогда
		Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");	
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция ПерезаполнитьПодчинённыеДокументы(ДокОснование)
	Результат = Новый Массив;
	МасДокументы = ПолучитьПодчинённыеДокументы(ДокОснование);
	Для Каждого Док Из МасДокументы Цикл
		ДокОбъект = Док.ПолучитьОбъект();
		ДокОбъект.Заполнить(ДокОснование);
	 	ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		Результат.Добавить(ДокОбъект.Ссылка);
	КонецЦикла;
	Возврат Результат;
КонецФункции	

// Запись оприходования или списания пересчета: проведение, при отказе - запись без проведения. По станку (волна 5,
// ревью плана P2-5) пустой новый документ не создается, а причина отказа проведения показывается: иначе отказ
// инварианта склада станка молча превращался в непроведенный документ.
//
// Параметры:
//  ДокОбъект - ДокументОбъект.ОприходованиеТоваров, ДокументОбъект.СписаниеТоваров - подчиненный документ
//  Результат - Массив из ДокументСсылка - записанные документы, пополняется
//
&НаСервере
Процедура ЗаписатьПодчиненныйДокумент(ДокОбъект, Результат)
	ПоСтанку = Объект.ВидОперации = Перечисления.ВидыСкладскихОпераций.Станок;
	Если ПоСтанку И ДокОбъект.ЭтоНовый() И ДокОбъект.ТЧТовары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Если Не ПоСтанку Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			Результат.Добавить(ДокОбъект.Ссылка);
			Возврат;
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат;
		КонецПопытки;
	КонецПопытки;
	Результат.Добавить(ДокОбъект.Ссылка);
КонецПроцедуры

&НаСервере
Функция СоздатьОприходованиеСписаниеТоваровНаСервере()
	Результат = Новый Массив;
	//НужноОприходование = Ложь;
	//НужноСписание = Ложь;
	//Для Каждого Стр Из Объект.ТЧТовары Цикл
	//	Если Стр.КоличествоУпаковок < Стр.КоличествоУпаковокФакт Тогда
	//		НужноОприходование = Истина;	
	//	КонецЕсли;
	//	Если Стр.КоличествоУпаковок > Стр.КоличествоУпаковокФакт Тогда
	//		НужноСписание = Истина;	
	//	КонецЕсли;
	//КонецЦикла;
	МасДокументы = ПолучитьПодчинённыеДокументы(Объект.Ссылка);
	//Если НужноОприходование Тогда
		ДокОприходование = Неопределено;
		Для Каждого Док Из МасДокументы Цикл
			Если ТипЗнч(Док) <> Тип("ДокументСсылка.ОприходованиеТоваров") Тогда Продолжить КонецЕсли;
			ДокОприходование = Док;
			Прервать;
		КонецЦикла;
		Если ЗначениеЗаполнено(ДокОприходование) Тогда
			ДокОприходование = ДокОприходование.ПолучитьОбъект();
			ДокОприходование.Заполнить(Объект.Ссылка);
		Иначе	
			ДокОприходование = Документы.ОприходованиеТоваров.СоздатьДокумент();
			ДокОприходование.Заполнить(Объект.Ссылка);
			ДокОприходование.Дата = ТекущаяДатаСеанса();
			ДокОприходование.УстановитьНовыйНомер();
		КонецЕсли;
		ЗаписатьПодчиненныйДокумент(ДокОприходование, Результат);	
	//КонецЕсли;
	//Если НужноСписание Тогда
		ДокСписание = Неопределено;
		Для Каждого Док Из МасДокументы Цикл
			Если ТипЗнч(Док) <> Тип("ДокументСсылка.СписаниеТоваров") Тогда Продолжить КонецЕсли;
			ДокСписание = Док;
			Прервать;
		КонецЦикла;
		Если ЗначениеЗаполнено(ДокСписание) Тогда
			ДокСписание = ДокСписание.ПолучитьОбъект();
			ДокСписание.Заполнить(Объект.Ссылка);	
		Иначе	
			ДокСписание = Документы.СписаниеТоваров.СоздатьДокумент();
			ДокСписание.Заполнить(Объект.Ссылка);
			ДокСписание.Дата = ТекущаяДатаСеанса();
			ДокСписание.УстановитьНовыйНомер();
		КонецЕсли;
		ЗаписатьПодчиненныйДокумент(ДокСписание, Результат);
	//КонецЕсли;
	Возврат Результат
КонецФункции

&НаСервере
Процедура ЗаполнитьПоЗаданиямНаПересчетНаСервере()
	Для Каждого Стр из Объект.ТЧТовары Цикл
		Стр.КоличествоУпаковокФакт = 0;
		Стр.КоличествоФакт = 0;
	КонецЦикла;
	ТЗ = ПолучитьОстаткиПоЗаданиям();
	Для Каждого Стр Из ТЗ Цикл
		Мас = Объект.ТЧТовары.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
		Если Мас.Количество() = 0 Тогда
			НС = Объект.ТЧТовары.Добавить();
			НС.Номенклатура = Стр.Номенклатура;
			НС.КоличествоУпаковокФакт = Стр.Количество;
			НС.КоличествоФакт = Стр.Количество;
		Иначе
			Мас[0].КоличествоУпаковокФакт = Стр.Количество;
			Мас[0].КоличествоФакт = Стр.Количество;	
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция ПолучитьОстаткиПоЗаданиям()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаданиеНаПересчетТЧТовары.Номенклатура КАК Номенклатура,
	|	СУММА(ЗаданиеНаПересчетТЧТовары.Количество) КАК Количество
	|ИЗ
	|	Документ.ЗаданиеНаПересчет.ТЧТовары КАК ЗаданиеНаПересчетТЧТовары
	|ГДЕ
	|	ЗаданиеНаПересчетТЧТовары.Ссылка.ПересчетТовара = &ПересчетТовара
	|	И НЕ ЗаданиеНаПересчетТЧТовары.Ссылка.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаданиеНаПересчетТЧТовары.Номенклатура";
	Запрос.УстановитьПараметр("ПересчетТовара",Объект.Ссылка);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбщуюКоманду(Команда)
	КомандыТабличныхЧастейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Количество") Тогда
		РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоПодбору(Объект, ВыбранноеЗначение, , Неопределено, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Вид операции «По станку» (волна 5): вместо склада - станок, место хранения - склад станка.

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ВидОперацииПриИзмененииНаСервере();
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыСкладскихОпераций.Станок") Тогда
		ПересчитатьСтрокиПоМестуХранения();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтанокПриИзменении(Элемент)
	СтанокПриИзмененииНаСервере();
	ПересчитатьСтрокиПоМестуХранения();
КонецПроцедуры

// Смена склада или станка при заполненных строках: учётное количество прежнего места хранения и введённый для него
// факт не годятся - иначе оприходование и списание по пересчёту возьмут чужие отклонения (ревью техдолга Codex, T25).
// Учётное перечитывается по новому месту хранения, факт обнуляется.
&НаКлиенте
Процедура ПересчитатьСтрокиПоМестуХранения()
	Если Объект.ТЧТовары.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьОстаткиНаСервере();
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		Стр.КоличествоУпаковокФакт = 0;
		Стр.КоличествоФакт = 0;
	КонецЦикла;
	РассчитатьОтклонения();
	ПоказатьПредупреждение(, НСтр("ru = 'Место хранения изменилось: учётные остатки перечитаны, фактическое количество очищено';
		|fr = 'Le lieu de stockage a changé : le stock théorique est relu, la quantité réelle est effacée';
		|en = 'The storage location changed: book stock was reread, the actual quantity was cleared';
		|es = 'El lugar de almacenamiento cambió: se releyó el stock contable y se borró la cantidad real'"));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СтанокПриИзмененииНаСервере()
	Объект.МестоХранения = ЗагрузкаСтанков.СкладСтанка(Объект.Станок);
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("МестоХранения", Объект.МестоХранения));
КонецПроцедуры

// Смена вида операции. «По станку» - склад станка (склад пользователя по умолчанию дал бы чужие остатки, ревью кода
// волны 5, P2-1); «По складу» - станок и его склад очищаются, склад выбирают заново (волна 5, P3). Заголовок и поля -
// по виду.
&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	Если Объект.ВидОперации = Перечисления.ВидыСкладскихОпераций.Станок Тогда
		СтанокПриИзмененииНаСервере();
	Иначе
		Если ЗначениеЗаполнено(Объект.Станок) Тогда
			Объект.Станок = Справочники.ПроизводственноеОборудование.ПустаяСсылка();
			Объект.МестоХранения = Справочники.МестаХранения.ПустаяСсылка();
			УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("МестоХранения", Объект.МестоХранения));
		КонецЕсли;
	КонецЕсли;
	НастроитьПолеСклада(ЭтотОбъект);
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтотОбъект, Объект, ЗагрузкаСтанков.ЗаголовокДокументаПоСтанку(Объект));
КонецПроцедуры

// Видимость полей склада и станка по виду операции.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма документа
//
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьПолеСклада(Форма)
	ПоСтанку = Форма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыСкладскихОпераций.Станок");
	Форма.Элементы.Станок.Видимость = ПоСтанку;
	Форма.Элементы.МестоХранения.Видимость = Не ПоСтанку;
КонецПроцедуры

#КонецОбласти
